//
//  Configure.h
//  OrderFood
//
//  Created by aplle on 7/25/13.
//  Copyright (c) 2013 handcent. All rights reserved.
//

#ifndef OrderFood_Configure_h
#define OrderFood_Configure_h

//service configure
//115.28.9.219
//114.215.102.38:8183   sa   123456
//#define SERVICE_IPADDR              @"115.28.9.219"
//#define SERVICE_PORT                9001

#define SERVICE_IPADDR              @"114.215.102.38"
#define SERVICE_PORT                9001

#define MAX_TIMEOUT                 18
//instruction
/*
 1、	验证：
 指令：0081#;
 返回：0081#OK;
 */
#define INS_CHECK                   @"0081"
/*
 2、	登录：
 指令：0083#帐户,密码;   如：0083#01,1;
 返回：正确：0083#OK帐户名字,ZS;  如 0083#OK张三,ZS;
 错误：0083#NO密码错误
 */
#define INS_LOGIN                   @"0083"
/*
 3、	获取包厢列表：
 指令：0002#
 返回：0002#包厢总数,包厢号,包厢状态,包厢名称,A区||包厢号,包厢状态,包厢名称,A区||;
 如：0002#60,101,K,101包厢,A区||102,U,102包厢,A区||;
 */
#define INS_GET_ROOM_LIST           @"0002"
/*
 4、	获取物品类型列表：
 指令：0003#
 返回：0003#,类别数量,类别编号,类别名称||类别编号,类别名称||;
 如：0003#,15,001,洋酒||002,饮料||;
 */
#define INS_GET_GOODS_CATEGORY_LIST @"0003"
/*
 5、	获取物品类型对应的物品列表
 指令：0004#房间id,物品类别;
 返回：0004#物品数量,编号,名称,单位,价格,0,类别编号||编号,名称,单位,价格,0,类别编号||;
 如：0004#45,0020001,可口可乐,瓶,5,0,002||0020002,雪碧,瓶,6,0,002||;
 *///无返回
#define INS_GET_GOODS_LIST          @"0004"
/*
 6、	落单
 0006#605,ZC,2,110036,百威啤酒330ml（听）,1,||120026,绝对伏特加原味70cl,1,||;
 指令：0006#包厢号,ZC,2,220115,福安伯爵,1,||220109,龙船古堡干红,1,||;
 返回：0006#OK;
 */
#define INS_BOOK                    @"0006"
/*
 7、	查单
 指令：0100#包厢号;
 返回：0100#开房时间:04/09 17:13||预  定  人:自来客||客人姓名:||已超低消:4078||消费总额:7608||服  务  费:0||折  扣  率:75%||折  扣  额:750||已付金额:7610||未付金额:0||;
 返回：  0100#NO此房尚未下单;
 *///没返回
#define INS_CHECK_ORDER             @"0100"
/*
 8、	开房定食
 指令：0101#包厢号;
 返回：0101#1,开房定食,例,1,528,528,528.0,0.0,Y/N,,17:131||
 2,果盘,份,3,0,0,0.0,0.0,Y/N,,17:132||
 *///没返回
#define INS_ROOM_BOOK               @"0101"
/*
 9、	出品说明：
 指令：0005#
 返回：0005#33,加糖||加冰||少冰||打包||加快||加辣||麻辣||不冻||七成熟||八成熟||全熟||少糖||加姜丝||少奶||不开||加温水||加茄酱||少辣||多油||加奶||加热||免葱||火机||芥辣||加辣打包||加冰加快||麻辣打包||加辣加快||冻||不出单||红人卡||例送||经理餐||;"
 *///没返回
#define INS_PUBLISH_DESCRIPTION     @"0005"


/*
 10、转房
指令： 1010#603，605;
 603转605
返回：1010#1或者0;
 */
#define INS_CHANGE_ROOM             @"1010"

/*
 11、套餐明细
 指令：0102#物品编号；
 如：0102#1001；
 返回：
 套餐：0102#明细个数，物品编号，物品名称，物品数量，物品单位||物品编号，物品名称，物品数量，物品单位||
 如： 0102#4,01020019,康师傅绿茶ml,6.00,瓶||01040017,黑牌威士忌ml,1.00,瓶||01010027,85盎司爆米花,1.00,份||12003,什锦大果盘 热卖,2.00,份||;
 非套餐：0102#0，；
 */
#define INS_TC_MX                   @"0102"

/*
 11、套餐明细
 指令：0023#包厢号；
 如：0023#1001；
 返回：
 
 */
#define INS_BX_ZT                   @"0023"

#endif
